--- Aar 02 Oracle 函数---

-- 组函数, 即聚合函数
----  输入多个值，最终只会返回一个值
----  组函数仅可用于选择列表或查询的having子句
----  单行函数： 输入一个值，输出一个值

-- 查询所有员工的薪水总和


-- 查看表中有多少条记录




-- 查看不同部门的人数记录


-- 字符函数
-- concat：表示字符串的连接  等同于 ||


-- 将字符串的首字母大写


-- 将字符串全部转换为大写


-- 将字符串全部转换为小写


-- 填充字符串




-- 去除空格






-- 查找指定字符串的位置


-- 查看字符串的长度


-- 截取字符串的操作


-- 替换操作


-- -数值函数-- -
-- 截取数据，给小数进行四舍五入操作，指定小数部分的位数



-- 截断数据, 按照位数去进行截取，但是不会进行四舍五入的操作



-- 取模操作



-- 向上取整


-- 向下取整


-- 取绝对值


-- 获取正负值




-- x的y次幂


-- 日期函数 --
-- 一般而言，公司业务在日期定义到秒。





---- 获取当前日期时间戳（依据系统而定）


-- add_months(): 添加指定的月份


-- 返回输入日期所在月份的最后一天


-- 两个日期相间隔的月份


-- 返回四舍五入的第一天


-- 返回下周的星期几


-- 提取日期中的时间











-- 返回日期的时间戳




-- 给指定的时间单位增加数值


-- 给指定的时间单位增加数值，并指定时间


-- 转换函数
---- 在oracle中存在数值的隐式转换和显式转换
---- 隐式转换指的是字符串可以转换为数值或者日期，反之也可




-- 显式转换：to_char: 当由数值或者日期转成字符串的时候，必须要规定格式
-- date ：to_char(), 






-- number : to_char()



-- to_date(): 转换之后都是固定的格式


-- to_number(): 转成数字


-- 单行函数嵌套
-- 显示没有上级管理的公司首脑
-- 没有上级领导的雇员 mgr显示为boss






-- 显示员工雇佣期满6个月后下一个星期五的日期





-- 条件函数--
-- decode,case when

-- 给不同部门的人员涨薪，10部门涨10%，20部门涨20%，30部门涨30%
---- decode


---- case when


-- 函数复习练习
-- 1. 查询82年员工


-- 2. 查询38年工龄的人员


-- 3. 显示员工雇佣期 6 个月后下一个星期一的日期


-- 4. 找没有上级的员工，把mgr的字段信息输出为 "boss"


-- 5. 为所有人长工资，标准是：10部门长10%；20部门长15%；30部门长20%其他部门长18%


-- 表单创建
/*
 create table CMCC(
   id number(10) primary key,
   type number(10) ,
   t_id number(10),
   value varchar2(5)
);
 insert into CMCC values(100,1,1,'张三');
 insert into CMCC values(200,2,1,'男');
 insert into CMCC values(300,3,1,'50');

 insert into CMCC values(101,1,2,'刘二');
 insert into CMCC values(201,2,2,'男');
 insert into CMCC values(301,3,2,'30');

 insert into CMCC values(102,1,3,'刘三');
 insert into CMCC values(202,2,3,'女');
 insert into CMCC values(302,3,3,'10');
*/

-- 需求发布
/* 将表的显示转换为：
-- 姓名      性别    年龄
--------  -------  ----
-- 张三       男     50
*/

-- 表单查询







-- 首先分组，再过滤 null






/* 组函数：聚组函数或者分组函数
-- 一般情况下，组函数都要和 group by 组合使用
-- 组函数一般用于选择列表或者having条件判断

-- 常用的组函数有5个
---- avg()  平均值,只用于数值类型的数据
---- min()  最小值，适用于任何类型
---- max()  最大值，适用于任何类型
---- sum()   求和，只适合数值类型的数据
---- count() 记录数, 处理的时候会跳过空值而处理非空值
------    count 一般用来获取表中的记录条数，
------    获取条数时, 可以使用*或者某一个具体的列, 甚至可以使用纯数字来代替，
------    但是从运行效率的角度考虑，建议使用数字或者某一个具体的列, 而不要使用 *
*/
-- 求员工薪水的最大，最小，平均，总和



-- count() 不要使用 * 






--  group by: 按照某些相同的值去进行分组操作
-- - group进行分组操作的时候，可以指定一个列或者多个列，
-- - 但是使用groupby 之后，选择列表中只能包含组函数的值或者group by 的普通字段
-- 求每个部门的平均薪水


-- 求平均新水大于2000的部门


-- 部门下雇员的工资 >2000 人数



-- 部门薪水最高



-- 部门里面 工龄最小和最大的人找出来, 找到员工姓名




-- 课堂练习
-- 1. 查询10号部门中编号最新入职的员工，工龄最长的员工的个人信息。


-- 2. 从 'software'找到'f'的位置，用'*'左戒右填充到15位，去除其中的'a'。


-- 3. 查询员工的奖金，如果奖金不为NULL显示'有奖金'，为null则显示无奖金


-- 4. 写一个查询显示当前日期，列标题显示为Date。再显示六个月后的日期，下一个星期 日的日期，该月最后一天的日期。


-- 5. 查询EMP表按管理者编号升序排列，如果管理者编号为空则把为空的在最前显示


-- 6. 求部门平均薪水


-- 7. 按部门求出工资大于1300人员的 部门编号、平均工资、最小佣金、最大佣金,幵且最大佣金大于100


-- 8. 找出每个部门的平均、最小、最大薪水


-- 9. 查询出雇员名，雇员所在部门名称， 工资等级。


